In [3]:
import numpy as np
import pandas as pd
import seaborn as sns

### 1. Iris - sns.load_dataset('Iris')

a. 붓꽃 종(species)별로 꽃잎길이(sepal_length), 꽃잎폭(sepal_width), 꽃받침길이(petal_length), 꽃받침폭(petal_width)의 평균, 표준편차 등 기초통계량(describe())을 구하시오.

b. 3분위수 (Q3)와 1분위수(Q1)의 차이보다 1.5배 크거나 작은 데이터는 이상치이다. 즉, Q1 - 1.5 * (Q3 - Q1)보다 작은 데이터 혹은 Q1 + 1.5 * (Q3 - Q1)보다 큰 데이터는 이상치이므로 제거하고 위의 4가지 항목에 대해서 평균, 표준편차를 구하시오.

In [33]:
import seaborn as sns
iris = sns.load_dataset("Iris")

In [138]:
# a
iris.groupby(iris.species)['sepal_length', 'sepal_width', 'petal_length', 'petal_width'].describe().T

species                setosa  versicolor  virginica
sepal_length count  50.000000   50.000000  50.000000
             mean    5.006000    5.936000   6.588000
             std     0.352490    0.516171   0.635880
             min     4.300000    4.900000   4.900000
             25%     4.800000    5.600000   6.225000
             50%     5.000000    5.900000   6.500000
             75%     5.200000    6.300000   6.900000
             max     5.800000    7.000000   7.900000
sepal_width  count  50.000000   50.000000  50.000000
             mean    3.428000    2.770000   2.974000
             std     0.379064    0.313798   0.322497
             min     2.300000    2.000000   2.200000
             25%     3.200000    2.525000   2.800000
             50%     3.400000    2.800000   3.000000
             75%     3.675000    3.000000   3.175000
             max     4.400000    3.400000   3.800000
petal_length count  50.000000   50.000000  50.000000
             mean    1.462000    4.260000   5.552000
             std     0.173664    0.469911   0.551895
             min     1.000000    3.000000   4.500000
             25%     1.400000    4.000000   5.100000
             50%     1.500000    4.350000   5.550000
             75%     1.575000    4.600000   5.875000
             max     1.900000    5.100000   6.900000
petal_width  count  50.000000   50.000000  50.000000
             mean    0.246000    1.326000   2.026000
             std     0.105386    0.197753   0.274650
             min     0.100000    1.000000   1.400000
             25%     0.200000    1.200000   1.800000
             50%     0.200000    1.300000   2.000000
             75%     0.300000    1.500000   2.300000
             max     0.600000    1.800000   2.500000

In [173]:
# b 포기

def q3cut_lower(s):

    Q1, Q3 = np.percentile(s, [25, 75])
    iqr = Q3 - Q1
    lower_bound = Q1 - (1.5 * iqr)
    return lower_bound

def q3cut_upper(s):

    Q1, Q3 = np.percentile(s, [25, 75])
    iqr = Q3 - Q1
    upper_bound = Q3 + (1.5 * iqr)
    return upper_bound

sepal_length_Q1 = q3cut_lower(iris.sepal_length)
sepal_length_Q3 = q3cut_upper(iris.sepal_length)

sepal_width_Q1 = q3cut_lower(iris.sepal_width)
sepal_width_Q3 = q3cut_upper(iris.sepal_width)

petal_length_Q1 = q3cut_lower(iris.petal_length)
petal_length_Q3 = q3cut_upper(iris.petal_length)

petal_width_Q1 = q3cut_lower(iris.petal_width)
petal_width_Q3 = q3cut_upper(iris.petal_width)


def distinguish_sepal_length(s):
    for i in range(len(iris.species)):
        x = iris.sepal_length[i]
        iris_sepal_length = []
        species_sepal_length = []
        if x < sepal_length_Q1 or x > sepal_length_Q3:
            continue
        else:
            y = iris.species[i]
            iris_sepal_length.append(x)
            species_sepal_length.append(y)
            print(iris_sepal_length, species_sepal_length)

def distinguish_sepal_width(s):
    for i in range(len(iris.species)):
        x = iris.sepal_width[i]
        iris_sepal_width = []
        species_sepal_width = []
        if x < sepal_width_Q1 or x > sepal_width_Q3:
            continue
        else:
            y = iris.species[i]
            iris_sepal_width.append(x)
            species_sepal_width.append(y)
            print(iris_sepal_width, species_sepal_width)
def distinguish_petal_length(s):
    for i in range(len(iris.species)):
        x = iris.petal_length[i]
        iris_petal_length = []
        species_petal_length = []
        if x < petal_length_Q1 or x > petal_length_Q3:
            continue
        else:
            y = iris.species[i]
            iris_petal_length.append(x)
            species_petal_length.append(y)
            print(iris_petal_length, species_petal_length)

def distinguish_petal_width(s):
    for i in range(len(iris.species)):
        x = iris.petal_width[i]
        iris_petal_width = []
        species_petal_width = []
        if x < petal_width_Q1 or x > petal_width_Q3:
            continue
        else:
            y = iris.species[i]
            iris_petal_width.append(x)
            species_petal_width.append(y)
            print(iris_petal_width, species_petal_width)

distinguish_sepal_length(iris.sepal_length)
distinguish_sepal_width(iris.sepal_width)
distinguish_petal_length(iris.petal_length)
distinguish_petal_width(iris.petal_width)

[5.1] ['setosa']
[4.9] ['setosa']
[4.7] ['setosa']
[4.6] ['setosa']
[5.0] ['setosa']
[5.4] ['setosa']
[4.6] ['setosa']
[5.0] ['setosa']
[4.4] ['setosa']
[4.9] ['setosa']
[5.4] ['setosa']
[4.8] ['setosa']
[4.8] ['setosa']
[4.3] ['setosa']
[5.8] ['setosa']
[5.7] ['setosa']
[5.4] ['setosa']
[5.1] ['setosa']
[5.7] ['setosa']
[5.1] ['setosa']
[5.4] ['setosa']
[5.1] ['setosa']
[4.6] ['setosa']
[5.1] ['setosa']
[4.8] ['setosa']
[5.0] ['setosa']
[5.0] ['setosa']
[5.2] ['setosa']
[5.2] ['setosa']
[4.7] ['setosa']
[4.8] ['setosa']
[5.4] ['setosa']
[5.2] ['setosa']
[5.5] ['setosa']
[4.9] ['setosa']
[5.0] ['setosa']
[5.5] ['setosa']
[4.9] ['setosa']
[4.4] ['setosa']
[5.1] ['setosa']
[5.0] ['setosa']
[4.5] ['setosa']
[4.4] ['setosa']
[5.0] ['setosa']
[5.1] ['setosa']
[4.8] ['setosa']
[5.1] ['setosa']
[4.6] ['setosa']
[5.3] ['setosa']
[5.0] ['setosa']
[7.0] ['versicolor']
[6.4] ['versicolor']
[6.9] ['versicolor']
[5.5] ['versicolor']
[6.5] ['versicolor']
[5.7] ['versicolor']
[6.3] ['versicolor']
[4.9] ['versicolor']
[6.6] ['versicolor']
[5.2] ['versicolor']
[5.0] ['versicolor']
[5.9] ['versicolor']
[6.0] ['versicolor']
[6.1] ['versicolor']
[5.6] ['versicolor']
[6.7] ['versicolor']
[5.6] ['versicolor']
[5.8] ['versicolor']
[6.2] ['versicolor']
[5.6] ['versicolor']
[5.9] ['versicolor']
[6.1] ['versicolor']
[6.3] ['versicolor']
[6.1] ['versicolor']
[6.4] ['versicolor']
[6.6] ['versicolor']
[6.8] ['versicolor']
[6.7] ['versicolor']
[6.0] ['versicolor']
[5.7] ['versicolor']
[5.5] ['versicolor']
[5.5] ['versicolor']
[5.8] ['versicolor']
[6.0] ['versicolor']
[5.4] ['versicolor']
[6.0] ['versicolor']
[6.7] ['versicolor']
[6.3] ['versicolor']
[5.6] ['versicolor']
[5.5] ['versicolor']
[5.5] ['versicolor']
[6.1] ['versicolor']
[5.8] ['versicolor']
[5.0] ['versicolor']
[5.6] ['versicolor']
[5.7] ['versicolor']
[5.7] ['versicolor']
[6.2] ['versicolor']
[5.1] ['versicolor']
[5.7] ['versicolor']
[6.3] ['virginica']
[5.8] ['virginica']
[7.1] ['virginica']
[6.3] ['virginica']
[6.5] ['virginica']
[7.6] ['virginica']
[4.9] ['virginica']
[7.3] ['virginica']
[6.7] ['virginica']
[7.2] ['virginica']
[6.5] ['virginica']
[6.4] ['virginica']
[6.8] ['virginica']
[5.7] ['virginica']
[5.8] ['virginica']
[6.4] ['virginica']
[6.5] ['virginica']
[7.7] ['virginica']
[7.7] ['virginica']
[6.0] ['virginica']
[6.9] ['virginica']
[5.6] ['virginica']
[7.7] ['virginica']
[6.3] ['virginica']
[6.7] ['virginica']
[7.2] ['virginica']
[6.2] ['virginica']
[6.1] ['virginica']
[6.4] ['virginica']
[7.2] ['virginica']
[7.4] ['virginica']
[7.9] ['virginica']
[6.4] ['virginica']
[6.3] ['virginica']
[6.1] ['virginica']
[7.7] ['virginica']
[6.3] ['virginica']
[6.4] ['virginica']
[6.0] ['virginica']
[6.9] ['virginica']
[6.7] ['virginica']
[6.9] ['virginica']
[5.8] ['virginica']
[6.8] ['virginica']
[6.7] ['virginica']
[6.7] ['virginica']
[6.3] ['virginica']
[6.5] ['virginica']
[6.2] ['virginica']
[5.9] ['virginica']
[3.5] ['setosa']
[3.0] ['setosa']
[3.2] ['setosa']
[3.1] ['setosa']
[3.6] ['setosa']
[3.9] ['setosa']
[3.4] ['setosa']
[3.4] ['setosa']
[2.9] ['setosa']
[3.1] ['setosa']
[3.7] ['setosa']
[3.4] ['setosa']
[3.0] ['setosa']
[3.0] ['setosa']
[4.0] ['setosa']
[3.9] ['setosa']
[3.5] ['setosa']
[3.8] ['setosa']
[3.8] ['setosa']
[3.4] ['setosa']
[3.7] ['setosa']
[3.6] ['setosa']
[3.3] ['setosa']
[3.4] ['setosa']
[3.0] ['setosa']
[3.4] ['setosa']
[3.5] ['setosa']
[3.4] ['setosa']
[3.2] ['setosa']
[3.1] ['setosa']
[3.4] ['setosa']
[3.1] ['setosa']
[3.2] ['setosa']
[3.5] ['setosa']
[3.6] ['setosa']
[3.0] ['setosa']
[3.4] ['setosa']
[3.5] ['setosa']
[2.3] ['setosa']
[3.2] ['setosa']
[3.5] ['setosa']
[3.8] ['setosa']
[3.0] ['setosa']
[3.8] ['setosa']
[3.2] ['setosa']
[3.7] ['setosa']
[3.3] ['setosa']
[3.2] ['versicolor']
[3.2] ['versicolor']
[3.1] ['versicolor']
[2.3] ['versicolor']
[2.8] ['versicolor']
[2.8] ['versicolor']
[3.3] ['versicolor']
[2.4] ['versicolor']
[2.9] ['versicolor']
[2.7] ['versicolor']
[3.0] ['versicolor']
[2.2] ['versicolor']
[2.9] ['versicolor']
[2.9] ['versicolor']
[3.1] ['versicolor']
[3.0] ['versicolor']
[2.7] ['versicolor']
[2.2] ['versicolor']
[2.5] ['versicolor']
[3.2] ['versicolor']
[2.8] ['versicolor']
[2.5] ['versicolor']
[2.8] ['versicolor']
[2.9] ['versicolor']
[3.0] ['versicolor']
[2.8] ['versicolor']
[3.0] ['versicolor']
[2.9] ['versicolor']
[2.6] ['versicolor']
[2.4] ['versicolor']
[2.4] ['versicolor']
[2.7] ['versicolor']
[2.7] ['versicolor']
[3.0] ['versicolor']
[3.4] ['versicolor']
[3.1] ['versicolor']
[2.3] ['versicolor']
[3.0] ['versicolor']
[2.5] ['versicolor']
[2.6] ['versicolor']
[3.0] ['versicolor']
[2.6] ['versicolor']
[2.3] ['versicolor']
[2.7] ['versicolor']
[3.0] ['versicolor']
[2.9] ['versicolor']
[2.9] ['versicolor']
[2.5] ['versicolor']
[2.8] ['versicolor']
[3.3] ['virginica']
[2.7] ['virginica']
[3.0] ['virginica']
[2.9] ['virginica']
[3.0] ['virginica']
[3.0] ['virginica']
[2.5] ['virginica']
[2.9] ['virginica']
[2.5] ['virginica']
[3.6] ['virginica']
[3.2] ['virginica']
[2.7] ['virginica']
[3.0] ['virginica']
[2.5] ['virginica']
[2.8] ['virginica']
[3.2] ['virginica']
[3.0] ['virginica']
[3.8] ['virginica']
[2.6] ['virginica']
[2.2] ['virginica']
[3.2] ['virginica']
[2.8] ['virginica']
[2.8] ['virginica']
[2.7] ['virginica']
[3.3] ['virginica']
[3.2] ['virginica']
[2.8] ['virginica']
[3.0] ['virginica']
[2.8] ['virginica']
[3.0] ['virginica']
[2.8] ['virginica']
[3.8] ['virginica']
[2.8] ['virginica']
[2.8] ['virginica']
[2.6] ['virginica']
[3.0] ['virginica']
[3.4] ['virginica']
[3.1] ['virginica']
[3.0] ['virginica']
[3.1] ['virginica']
[3.1] ['virginica']
[3.1] ['virginica']
[2.7] ['virginica']
[3.2] ['virginica']
[3.3] ['virginica']
[3.0] ['virginica']
[2.5] ['virginica']
[3.0] ['virginica']
[3.4] ['virginica']
[3.0] ['virginica']
[1.4] ['setosa']
[1.4] ['setosa']
[1.3] ['setosa']
[1.5] ['setosa']
[1.4] ['setosa']
[1.7] ['setosa']
[1.4] ['setosa']
[1.5] ['setosa']
[1.4] ['setosa']
[1.5] ['setosa']
[1.5] ['setosa']
[1.6] ['setosa']
[1.4] ['setosa']
[1.1] ['setosa']
[1.2] ['setosa']
[1.5] ['setosa']
[1.3] ['setosa']
[1.4] ['setosa']
[1.7] ['setosa']
[1.5] ['setosa']
[1.7] ['setosa']
[1.5] ['setosa']
[1.0] ['setosa']
[1.7] ['setosa']
[1.9] ['setosa']
[1.6] ['setosa']
[1.6] ['setosa']
[1.5] ['setosa']
[1.4] ['setosa']
[1.6] ['setosa']
[1.6] ['setosa']
[1.5] ['setosa']
[1.5] ['setosa']
[1.4] ['setosa']
[1.5] ['setosa']
[1.2] ['setosa']
[1.3] ['setosa']
[1.4] ['setosa']
[1.3] ['setosa']
[1.5] ['setosa']
[1.3] ['setosa']
[1.3] ['setosa']
[1.3] ['setosa']
[1.6] ['setosa']
[1.9] ['setosa']
[1.4] ['setosa']
[1.6] ['setosa']
[1.4] ['setosa']
[1.5] ['setosa']
[1.4] ['setosa']
[4.7] ['versicolor']
[4.5] ['versicolor']
[4.9] ['versicolor']
[4.0] ['versicolor']
[4.6] ['versicolor']
[4.5] ['versicolor']
[4.7] ['versicolor']
[3.3] ['versicolor']
[4.6] ['versicolor']
[3.9] ['versicolor']
[3.5] ['versicolor']
[4.2] ['versicolor']
[4.0] ['versicolor']
[4.7] ['versicolor']
[3.6] ['versicolor']
[4.4] ['versicolor']
[4.5] ['versicolor']
[4.1] ['versicolor']
[4.5] ['versicolor']
[3.9] ['versicolor']
[4.8] ['versicolor']
[4.0] ['versicolor']
[4.9] ['versicolor']
[4.7] ['versicolor']
[4.3] ['versicolor']
[4.4] ['versicolor']
[4.8] ['versicolor']
[5.0] ['versicolor']
[4.5] ['versicolor']
[3.5] ['versicolor']
[3.8] ['versicolor']
[3.7] ['versicolor']
[3.9] ['versicolor']
[5.1] ['versicolor']
[4.5] ['versicolor']
[4.5] ['versicolor']
[4.7] ['versicolor']
[4.4] ['versicolor']
[4.1] ['versicolor']
[4.0] ['versicolor']
[4.4] ['versicolor']
[4.6] ['versicolor']
[4.0] ['versicolor']
[3.3] ['versicolor']
[4.2] ['versicolor']
[4.2] ['versicolor']
[4.2] ['versicolor']
[4.3] ['versicolor']
[3.0] ['versicolor']
[4.1] ['versicolor']
[6.0] ['virginica']
[5.1] ['virginica']
[5.9] ['virginica']
[5.6] ['virginica']
[5.8] ['virginica']
[6.6] ['virginica']
[4.5] ['virginica']
[6.3] ['virginica']
[5.8] ['virginica']
[6.1] ['virginica']
[5.1] ['virginica']
[5.3] ['virginica']
[5.5] ['virginica']
[5.0] ['virginica']
[5.1] ['virginica']
[5.3] ['virginica']
[5.5] ['virginica']
[6.7] ['virginica']
[6.9] ['virginica']
[5.0] ['virginica']
[5.7] ['virginica']
[4.9] ['virginica']
[6.7] ['virginica']
[4.9] ['virginica']
[5.7] ['virginica']
[6.0] ['virginica']
[4.8] ['virginica']
[4.9] ['virginica']
[5.6] ['virginica']
[5.8] ['virginica']
[6.1] ['virginica']
[6.4] ['virginica']
[5.6] ['virginica']
[5.1] ['virginica']
[5.6] ['virginica']
[6.1] ['virginica']
[5.6] ['virginica']
[5.5] ['virginica']
[4.8] ['virginica']
[5.4] ['virginica']
[5.6] ['virginica']
[5.1] ['virginica']
[5.1] ['virginica']
[5.9] ['virginica']
[5.7] ['virginica']
[5.2] ['virginica']
[5.0] ['virginica']
[5.2] ['virginica']
[5.4] ['virginica']
[5.1] ['virginica']
[0.2] ['setosa']
[0.2] ['setosa']
[0.2] ['setosa']
[0.2] ['setosa']
[0.2] ['setosa']
[0.4] ['setosa']
[0.3] ['setosa']
[0.2] ['setosa']
[0.2] ['setosa']
[0.1] ['setosa']
[0.2] ['setosa']
[0.2] ['setosa']
[0.1] ['setosa']
[0.1] ['setosa']
[0.2] ['setosa']
[0.4] ['setosa']
[0.4] ['setosa']
[0.3] ['setosa']
[0.3] ['setosa']
[0.3] ['setosa']
[0.2] ['setosa']
[0.4] ['setosa']
[0.2] ['setosa']
[0.5] ['setosa']
[0.2] ['setosa']
[0.2] ['setosa']
[0.4] ['setosa']
[0.2] ['setosa']
[0.2] ['setosa']
[0.2] ['setosa']
[0.2] ['setosa']
[0.4] ['setosa']
[0.1] ['setosa']
[0.2] ['setosa']
[0.2] ['setosa']
[0.2] ['setosa']
[0.2] ['setosa']
[0.1] ['setosa']
[0.2] ['setosa']
[0.2] ['setosa']
[0.3] ['setosa']
[0.3] ['setosa']
[0.2] ['setosa']
[0.6] ['setosa']
[0.4] ['setosa']
[0.3] ['setosa']
[0.2] ['setosa']
[0.2] ['setosa']
[0.2] ['setosa']
[0.2] ['setosa']
[1.4] ['versicolor']
[1.5] ['versicolor']
[1.5] ['versicolor']
[1.3] ['versicolor']
[1.5] ['versicolor']
[1.3] ['versicolor']
[1.6] ['versicolor']
[1.0] ['versicolor']
[1.3] ['versicolor']
[1.4] ['versicolor']
[1.0] ['versicolor']
[1.5] ['versicolor']
[1.0] ['versicolor']
[1.4] ['versicolor']
[1.3] ['versicolor']
[1.4] ['versicolor']
[1.5] ['versicolor']
[1.0] ['versicolor']
[1.5] ['versicolor']
[1.1] ['versicolor']
[1.8] ['versicolor']
[1.3] ['versicolor']
[1.5] ['versicolor']
[1.2] ['versicolor']
[1.3] ['versicolor']
[1.4] ['versicolor']
[1.4] ['versicolor']
[1.7] ['versicolor']
[1.5] ['versicolor']
[1.0] ['versicolor']
[1.1] ['versicolor']
[1.0] ['versicolor']
[1.2] ['versicolor']
[1.6] ['versicolor']
[1.5] ['versicolor']
[1.6] ['versicolor']
[1.5] ['versicolor']
[1.3] ['versicolor']
[1.3] ['versicolor']
[1.3] ['versicolor']
[1.2] ['versicolor']
[1.4] ['versicolor']
[1.2] ['versicolor']
[1.0] ['versicolor']
[1.3] ['versicolor']
[1.2] ['versicolor']
[1.3] ['versicolor']
[1.3] ['versicolor']
[1.1] ['versicolor']
[1.3] ['versicolor']
[2.5] ['virginica']
[1.9] ['virginica']
[2.1] ['virginica']
[1.8] ['virginica']
[2.2] ['virginica']
[2.1] ['virginica']
[1.7] ['virginica']
[1.8] ['virginica']
[1.8] ['virginica']
[2.5] ['virginica']
[2.0] ['virginica']
[1.9] ['virginica']
[2.1] ['virginica']
[2.0] ['virginica']
[2.4] ['virginica']
[2.3] ['virginica']
[1.8] ['virginica']
[2.2] ['virginica']
[2.3] ['virginica']
[1.5] ['virginica']
[2.3] ['virginica']
[2.0] ['virginica']
[2.0] ['virginica']
[1.8] ['virginica']
[2.1] ['virginica']
[1.8] ['virginica']
[1.8] ['virginica']
[1.8] ['virginica']
[2.1] ['virginica']
[1.6] ['virginica']
[1.9] ['virginica']
[2.0] ['virginica']
[2.2] ['virginica']
[1.5] ['virginica']
[1.4] ['virginica']
[2.3] ['virginica']
[2.4] ['virginica']
[1.8] ['virginica']
[1.8] ['virginica']
[2.1] ['virginica']
[2.4] ['virginica']
[2.3] ['virginica']
[1.9] ['virginica']
[2.3] ['virginica']
[2.5] ['virginica']
[2.3] ['virginica']
[1.9] ['virginica']
[2.0] ['virginica']
[2.3] ['virginica']
[1.8] ['virginica']

### 2. Titanic - sns.load_dataset('titanic')

a. 타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category1 열을 만드시오. category1 카테고리는 다음과 같이 정의됨
    1) 20살이 넘으면 성별을 그대로 사용한다.
    2) 20살 미만이면 성별에 관계없이 "child"라고 한다.

b. 타이타닉호의 승객 중 나이를 명시하지 않는 고객은 나이를 명시한 고객의 평균 나이 값이 되도록 titanic 데이터 프레임을 고치시오.

c. 성별, 선실(class)별, 출발지(embark_town)별 생존율을 구하시오.

d. 타이타닉호 승객을 '미성년자', '청년', '중년', '장년', '노년' 나이 그룹으로 나누고, 각 그룹별 생존율을 구하시오.
    bin = [1, 20, 30, 50, 70, 100]
    labels = ['미성년자', '청년', '중년', '장년', '노년']

e. qcut 명령으로 세 개의 나이 그룹을 만들고, 나이 그룹별 남녀 성비와 생존율을 구하시오.

In [280]:
titanic = sns.load_dataset("titanic")
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [281]:
# a 
titanic["category1"] = titanic.apply(lambda r: r.sex if r.age >= 20 else "child", axis=1)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,male
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,male
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,male

In [282]:
# b
titanic['age'] = titanic['age'].fillna(round(titanic.age.mean(), 2))
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,male
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,29.7,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,male
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,male

In [298]:
# c 성별 생존
titanic2 = titanic[titanic.survived == 1]
titanic2

titanic3 = titanic2[titanic2.sex == 'female'] # 여자 생존
titanic3

titanic3.count()['survived']

233

In [299]:
titanic4 = titanic2[titanic2.sex == 'male'] # 남자 생존
titanic4

titanic4.count()['survived']

109

In [300]:
# 성별 생존 결과값
x = titanic4.count()['survived'] / titanic.count()['survived']
y = titanic3.count()['survived'] / titanic.count()['survived']

print('남성 생존율 :', x)
print('여성 생존율 :', y)

남성 생존율 : 0.122334455667789
여성 생존율 : 0.2615039281705948

In [287]:
# c 선실별 생존
titanic5 = titanic2[titanic2.pclass == 1]
titanic5

titanic6 = titanic2[titanic2.pclass == 2]
titanic6

titanic7 = titanic2[titanic2.pclass == 3]
titanic7

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,female
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False,female
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False,child
19,1,3,female,29.7,0,0,7.2250,C,Third,woman,False,NaN,Cherbourg,yes,True,child
22,1,3,female,15.0,0,0,8.0292,Q,Third,child,False,NaN,Queenstown,yes,True,child
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
838,1,3,male,32.0,0,0,56.4958,S,Third,man,True,NaN,Southampton,yes,True,male
855,1,3,female,18.0,0,1,9.3500,S,Third,woman,False,NaN,Southampton,yes,False,child
858,1,3,female,24.0,0,3,19.2583,C,Third,woman,False,NaN,Cherbourg,yes,False,female
869,1,3,male,4.0,1,1,11.1333,S,Third,child,False,NaN,Southampton,yes,False,child
875,1,3,female,15.0,0,0,7.2250,C,Third,child,False,NaN,Cherbourg,yes,True,child

In [301]:
# 선실별 생존 결과값
a = titanic5.count()['survived'] / titanic.count()['survived']
b = titanic6.count()['survived'] / titanic.count()['survived']
c = titanic7.count()['survived'] / titanic.count()['survived']

print('First Class 생존율 :', a)
print('Second Class 생존율 :', b)
print('Third Class 생존율 :', c)

First Class 생존율 : 0.1526374859708193
Second Class 생존율 : 0.09764309764309764
Third Class 생존율 : 0.1335578002244669

In [234]:
# c 출발지 생존
titanic8 = titanic2[titanic2.embarked == 'S']
titanic8

titanic9 = titanic2[titanic2.embarked == 'C']
titanic9

titanic10 = titanic2[titanic2.embarked == 'Q']
titanic10

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1
22,1,3,female,15.0,0,0,8.0292,Q,Third,child,False,NaN,Queenstown,yes,True,child
28,1,3,female,29.7,0,0,7.8792,Q,Third,woman,False,NaN,Queenstown,yes,True,child
32,1,3,female,29.7,0,0,7.7500,Q,Third,woman,False,NaN,Queenstown,yes,True,child
44,1,3,female,19.0,0,0,7.8792,Q,Third,woman,False,NaN,Queenstown,yes,True,child
47,1,3,female,29.7,0,0,7.7500,Q,Third,woman,False,NaN,Queenstown,yes,True,child
82,1,3,female,29.7,0,0,7.7875,Q,Third,woman,False,NaN,Queenstown,yes,True,child
109,1,3,female,29.7,1,0,24.1500,Q,Third,woman,False,NaN,Queenstown,yes,False,child
156,1,3,female,16.0,0,0,7.7333,Q,Third,woman,False,NaN,Queenstown,yes,True,child
186,1,3,female,29.7,1,0,15.5000,Q,Third,woman,False,NaN,Queenstown,yes,False,child
198,1,3,female,29.7,0,0,7.7500,Q,Third,woman,False,NaN,Queenstown,yes,True,child
208,1,3,female,16.0,0,0,7.7500,Q,Third,woman,False,NaN,Queenstown,yes,True,child
241,1,3,female,29.7,1,0,15.5000,Q,Third,woman,False,NaN,Queenstown,yes,False,child
274,1,3,female,29.7,0,0,7.7500,Q,Third,woman,False,NaN,Queenstown,yes,True,child
289,1,3,female,22.0,0,0,7.7500,Q,Third,woman,False,NaN,Queenstown,yes,True,female
300,1,3,female,29.7,0,0,7.7500,Q,Third,woman,False,NaN,Queenstown,yes,True,child
301,1,3,male,29.7,2,0,23.2500,Q,Third,man,True,NaN,Queenstown,yes,False,child
303,1,2,female,29.7,0,0,12.3500,Q,Second,woman,False,E,Queenstown,yes,True,child
322,1,2,female,30.0,0,0,12.3500,Q,Second,woman,False,NaN,Queenstown,yes,True,female
330,1,3,female,29.7,2,0,23.2500,Q,Third,woman,False,NaN,Queenstown,yes,False,child
358,1,3,female,29.7,0,0,7.8792,Q,Third,woman,False,NaN,Queenstown,yes,True,child
359,1,3,female,29.7,0,0,7.8792,Q,Third,woman,False,NaN,Queenstown,yes,True,child
368,1,3,female,29.7,0,0,7.7500,Q,Third,woman,False,NaN,Queenstown,yes,True,child
412,1,1,female,33.0,1,0,90.0000,Q,First,woman,False,C,Queenstown,yes,False,female
510,1,3,male,29.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,yes,True,male
573,1,3,female,29.7,0,0,7.7500,Q,Third,woman,False,NaN,Queenstown,yes,True,child
612,1,3,female,29.7,1,0,15.5000,Q,Third,woman,False,NaN,Queenstown,yes,False,child
653,1,3,female,29.7,0,0,7.8292,Q,Third,woman,False,NaN,Queenstown,yes,True,child
697,1,3,female,29.7,0,0,7.7333,Q,Third,woman,False,NaN,Queenstown,yes,True,child
727,1,3,female,29.7,0,0,7.7375,Q,Third,woman,False,NaN,Queenstown,yes,True,child
828,1,3,male,29.7,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,yes,True,child

In [302]:
# 출발지별 생존 결과값
i = titanic8.count()['survived'] / titanic.count()['survived']
o = titanic9.count()['survived'] / titanic.count()['survived']
q = titanic10.count()['survived'] / titanic.count()['survived']

print('S출발지 생존욜 :', i)
print('C출발지 생존율 :', o)
print('Q출발지 생존율 :', q)

S출발지 생존욜 : 0.24354657687991021
C출발지 생존율 : 0.10437710437710437
Q출발지 생존율 : 0.03367003367003367

In [303]:
# d

bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
titanics = pd.cut(titanic['age'], bins, labels=labels)

print(titanics)

0        청년
1        중년
2        청년
3        중년
4        중년
       ...
886      청년
887    미성년자
888      청년
889      청년
890      중년
Name: age, Length: 891, dtype: category
Categories (5, object): [미성년자 < 청년 < 중년 < 장년 < 노년]

In [304]:
# e. qcut 명령으로 세 개의 나이 그룹을 만들고, 나이 그룹별 남녀 성비와 생존율을 구하시오.

def q3cut(s):
    return pd.qcut(s, 3, labels=["젊음", "중간", "늙음"]).astype(str)


titanic["age_class"] = titanic.groupby(titanic.sex).age.transform(q3cut)
titanic[["age", "age_class", "sex"]].tail(10)

      age age_class     sex
881  33.0        늙음    male
882  22.0        젊음  female
883  28.0        중간    male
884  25.0        젊음    male
885  39.0        늙음  female
886  27.0        젊음    male
887  19.0        젊음  female
888  29.7        중간  female
889  26.0        젊음    male
890  32.0        늙음    male

In [305]:
titanic11 = titanic3[titanic.age_class == '젊음']
titanic12 = titanic3[titanic.age_class == '중간']
titanic13 = titanic3[titanic.age_class == '늙음']

titanic14 = titanic4[titanic.age_class == '젊음']
titanic15 = titanic4[titanic.age_class == '중간']
titanic16 = titanic4[titanic.age_class == '늙음']

In [344]:
female_young = titanic11.count()['age_class'] / titanic3.count()['survived']
female = titanic12.count()['age_class'] / titanic3.count()['survived']
female_old = titanic13.count()['age_class'] / titanic3.count()['survived']

male_young = titanic14.count()['age_class'] / titanic4.count()['survived']
male = titanic15.count()['age_class'] / titanic4.count()['survived']
male_old = titanic16.count()['age_class'] / titanic4.count()['survived']

In [350]:
# 나이 그룹별 남녀 생존율
w_young = titanic11.count()['age_class']/(titanic11.count()['age_class']+titanic14.count()['age_class'])
m_young = titanic14.count()['age_class']/(titanic11.count()['age_class']+titanic14.count()['age_class'])

w = titanic12.count()['age_class']/(titanic12.count()['age_class']+titanic15.count()['age_class'])
m = titanic15.count()['age_class']/(titanic12.count()['age_class']+titanic15.count()['age_class'])

w_old = titanic13.count()['age_class']/(titanic13.count()['age_class']+titanic16.count()['age_class'])
m_old = titanic16.count()['age_class']/(titanic13.count()['age_class']+titanic16.count()['age_class'])

print('젊은여자 생존율 : 젊은남자 생존율 = ', w_young, ':', m_young)
print('젊은여자 생존율 : 젊은남자 생존율 = ', w, ':', m)
print('젊은여자 생존율 : 젊은남자 생존율 = ', w_old, ':', m_old)

젊은여자 생존율 : 젊은남자 생존율 =  0.648854961832061 : 0.3511450381679389
젊은여자 생존율 : 젊은남자 생존율 =  0.7222222222222222 : 0.2777777777777778
젊은여자 생존율 : 젊은남자 생존율 =  0.6859504132231405 : 0.3140495867768595

In [332]:
# 남녀 성비 생존율

print('젊은 여성 생존율 :', female_young)
print('중간 여성 생존율 :', female)
print('늙은 여성 생존율 :', female_old)
print('젊은 남성 생존율 :', male_young)
print('중간 남성 생존율 :', male)
print('늙은 남성 생존율 :', male_old)

젊은 여성 생존율 : 0.3648068669527897
중간 여성 생존율 : 0.27896995708154504
늙은 여성 생존율 : 0.3562231759656652
젊은 남성 생존율 : 0.42201834862385323
중간 남성 생존율 : 0.22935779816513763
늙은 남성 생존율 : 0.3486238532110092

### 3. Mile Per Gallon - sns.load_dataset('mpg')

a. 배기량(displacement) 대비 마력(horsepower) 열(hp_per_cc)을 추가하시오.

b. name으로부터 manufacturer(제조사)와 모델을 추출하여 새로운 열 manufacturer와 model을 추가하고, name 열은 삭제하시오.

c. 엔진의 실린더(cylinders) 갯수별 연비(mpg)의 평균을 구하시오.

d. 생산지(origin)별 배기량 대비 마력(hp_per_cc)의 평균을 구하시오.

e. 모델이 5개 이상인 제조사에 대하여 연비(mpg)의 평균이 가장 좋은 제조사 Top5를 구하시오.